In [ ]:
import datetime as dt

In [ ]:
d1 = dt.datetime.now()
print(d1)

2021-02-11 11:00:40.362977

In [ ]:
print(d1.day, d1.month,d1.year, d1.hour, d1.minute,d1.second)

11 2 2021 11 0 40

---

In [ ]:
d2 = d1 + dt.timedelta(hours = 5, minutes = 30)
print(d2)

2021-02-11 16:30:40.362977

In [ ]:
d3 = d1 - dt.timedelta(hours = 7)
print(d3)

2021-02-11 04:00:40.362977

---

In [ ]:
s1 = d2.strftime('%B %d, %Y %I : %M : %S %p')
s1

'February 11, 2021 04 : 30 : 40 PM'

In [ ]:
d5 = d2.date().strftime('%d %b %Y')
d6 = d2.time().strftime('%I:%M:%S %p')
print(d5 , d6)

11 Feb 2021 04:30:40 PM

---

In [ ]:
d7 = dt.datetime.strptime('December 26, 2019 03:34:00 AM', "%B %d, %Y %I:%M:%S %p")
print(d7, type(d7))

2019-12-26 03:34:00 <class 'datetime.datetime'>

In [ ]:
nxt = d7 + dt.timedelta(days=6585.3)
print(nxt)

2038-01-05 10:46:00

Last annular solar eclipse will repeat again on 5 January 2038 at about 10:47 AM. You can verify it by opening the document provided below and jumping to page number A-480.

[List of Solar Eclipses](https://eclipse.gsfc.nasa.gov/5MCSE/5MCSE-Maps-10.pdf)


<img src='https://student-datasets-bucket.s3.ap-south-1.amazonaws.com/images/next_annular_solar_eclipse2038.png' width=800>

We can create separate `datetime.date` and `datetime.time` objects by passing values to the `date()` and `time()` functions.

In [ ]:
bd = dt.date(2005, 5, 2)
print(bd)

2005-05-02

In [ ]:
bd1 = dt.time(14, 5, 3)
print(bd1)

14:05:03

---

#### Activity 7: Continuing Air Quality Analysis

Let's continue with the air quality analysis. We need to load the dataset, remove the `Unnamed: 15` & `Unnamed: 16` columns and drop the null values.

Also, in the previous class, we created a new Pandas series containing the concatenated date and time values.

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

csv_file = 'https://student-datasets-bucket.s3.ap-south-1.amazonaws.com/whitehat-ds-datasets/air-quality/AirQualityUCI.csv'
df = pd.read_csv(csv_file, sep=';')

df = df.drop(columns=['Unnamed: 15', 'Unnamed: 16'], axis=1)
df = df.dropna()
dt_series = df['Date'] + ' ' + pd.Series(data=[str(item).replace(".", ":") for item in df['Time']], index=df.index)
dt_series = pd.to_datetime(dt_series)
dt_series

0      2004-10-03 18:00:00
1      2004-10-03 19:00:00
2      2004-10-03 20:00:00
3      2004-10-03 21:00:00
4      2004-10-03 22:00:00
               ...
9352   2005-04-04 10:00:00
9353   2005-04-04 11:00:00
9354   2005-04-04 12:00:00
9355   2005-04-04 13:00:00
9356   2005-04-04 14:00:00
Length: 9357, dtype: datetime64[ns]

Let's remove the `Date` & `Time` columns from the DataFrame because we don't need them and insert the `dt_series` in it because it contains the `datetime` objects.

In [ ]:
df.head()

         Date      Time CO(GT)  PT08.S1(CO)  ...  PT08.S5(O3)     T    RH      AH
0  10/03/2004  18.00.00    2,6       1360.0  ...       1268.0  13,6  48,9  0,7578
1  10/03/2004  19.00.00      2       1292.0  ...        972.0  13,3  47,7  0,7255
2  10/03/2004  20.00.00    2,2       1402.0  ...       1074.0  11,9  54,0  0,7502
3  10/03/2004  21.00.00    2,2       1376.0  ...       1203.0  11,0  60,0  0,7867
4  10/03/2004  22.00.00    1,6       1272.0  ...       1110.0  11,2  59,6  0,7888

[5 rows x 15 columns]

Let's add the `dt_series` Pandas series to the DataFrame at `index = 0`. Also, let's label it as a `DateTime` column.

In [ ]:
df = df.drop(['Date','Time'],axis = 1)
df.insert(loc =0,column = 'DateTime',value = dt_series)

In [ ]:
df.head()

             DateTime CO(GT)  PT08.S1(CO)  ...     T    RH      AH
0 2004-10-03 18:00:00    2,6       1360.0  ...  13,6  48,9  0,7578
1 2004-10-03 19:00:00      2       1292.0  ...  13,3  47,7  0,7255
2 2004-10-03 20:00:00    2,2       1402.0  ...  11,9  54,0  0,7502
3 2004-10-03 21:00:00    2,2       1376.0  ...  11,0  60,0  0,7867
4 2004-10-03 22:00:00    1,6       1272.0  ...  11,2  59,6  0,7888

[5 rows x 14 columns]

---

In [ ]:
y_s = dt_series.dt.year
y_s

0       2004
1       2004
2       2004
3       2004
4       2004
        ...
9352    2005
9353    2005
9354    2005
9355    2005
9356    2005
Length: 9357, dtype: int64

In [ ]:
ms = dt_series.dt.month
ms

0       10
1       10
2       10
3       10
4       10
        ..
9352     4
9353     4
9354     4
9355     4
9356     4
Length: 9357, dtype: int64

In [ ]:
ds = dt_series.dt.day
ds

0       3
1       3
2       3
3       3
4       3
       ..
9352    4
9353    4
9354    4
9355    4
9356    4
Length: 9357, dtype: int64

In [ ]:
dns = dt_series.dt.day_name()
dns

0       Sunday
1       Sunday
2       Sunday
3       Sunday
4       Sunday
         ...
9352    Monday
9353    Monday
9354    Monday
9355    Monday
9356    Monday
Length: 9357, dtype: object

In [ ]:
df['Year'] = y_s
df['Month'] = ms
df['Day'] = ds
df['Day of the Week'] = dns
df.head()

             DateTime CO(GT)  PT08.S1(CO)  ...  Month Day  Day of the Week
0 2004-10-03 18:00:00    2,6       1360.0  ...     10   3           Sunday
1 2004-10-03 19:00:00      2       1292.0  ...     10   3           Sunday
2 2004-10-03 20:00:00    2,2       1402.0  ...     10   3           Sunday
3 2004-10-03 21:00:00    2,2       1376.0  ...     10   3           Sunday
4 2004-10-03 22:00:00    1,6       1272.0  ...     10   3           Sunday

[5 rows x 18 columns]

In [ ]:
df = df.sort_values(by = 'DateTime')
df.head(30)

                DateTime CO(GT)  PT08.S1(CO)  ...  Month Day  Day of the Week
510  2004-01-04 00:00:00    1,6       1143.0  ...      1   4           Sunday
511  2004-01-04 01:00:00    1,2       1044.0  ...      1   4           Sunday
512  2004-01-04 02:00:00    1,1       1034.0  ...      1   4           Sunday
513  2004-01-04 03:00:00    0,9        956.0  ...      1   4           Sunday
514  2004-01-04 04:00:00    0,7        909.0  ...      1   4           Sunday
515  2004-01-04 05:00:00    0,9        996.0  ...      1   4           Sunday
516  2004-01-04 06:00:00    1,7       1154.0  ...      1   4           Sunday
517  2004-01-04 07:00:00    4,2       1510.0  ...      1   4           Sunday
518  2004-01-04 08:00:00    6,2       1722.0  ...      1   4           Sunday
519  2004-01-04 09:00:00    4,6       1512.0  ...      1   4           Sunday
520  2004-01-04 10:00:00    2,8       1258.0  ...      1   4           Sunday
521  2004-01-04 11:00:00    1,6       1094.0  ...      1   4           Sunday
522  2004-01-04 12:00:00    1,7       1129.0  ...      1   4           Sunday
523  2004-01-04 13:00:00    1,7       1125.0  ...      1   4           Sunday
524  2004-01-04 14:00:00    1,7       -200.0  ...      1   4           Sunday
525  2004-01-04 15:00:00    1,9       -200.0  ...      1   4           Sunday
526  2004-01-04 16:00:00    2,3       -200.0  ...      1   4           Sunday
527  2004-01-04 17:00:00    3,3       1308.0  ...      1   4           Sunday
528  2004-01-04 18:00:00    4,2       1529.0  ...      1   4           Sunday
529  2004-01-04 19:00:00    5,5       1592.0  ...      1   4           Sunday
530  2004-01-04 20:00:00    4,9       1536.0  ...      1   4           Sunday
531  2004-01-04 21:00:00    2,5       1192.0  ...      1   4           Sunday
532  2004-01-04 22:00:00      2       1186.0  ...      1   4           Sunday
533  2004-01-04 23:00:00      2       1203.0  ...      1   4           Sunday
1230 2004-01-05 00:00:00    3,5       1425.0  ...      1   5           Monday
1231 2004-01-05 01:00:00    2,4       1179.0  ...      1   5           Monday
1232 2004-01-05 02:00:00    1,6       1047.0  ...      1   5           Monday
1233 2004-01-05 03:00:00    1,3       1009.0  ...      1   5           Monday
1234 2004-01-05 04:00:00   -200        882.0  ...      1   5           Monday
1235 2004-01-05 05:00:00    0,6        858.0  ...      1   5           Monday

[30 rows x 18 columns]

---